In [3]:
import pandas as pd
import numpy as np


idx=['A','A','B','B','B','C','C','C','D','D','D','D','E','E','E']
col=['col1','col2','col3']
data = np.random.randint(0,9,(15,3))
df = pd.DataFrame(data=data, index=idx, columns=col).reset_index()
print(df)

   index  col1  col2  col3
0      A     4     2     5
1      A     4     8     0
2      B     3     3     2
3      B     7     2     6
4      B     8     0     3
5      C     8     2     7
6      C     3     8     3
7      C     1     1     1
8      D     4     1     8
9      D     8     8     2
10     D     1     0     1
11     D     1     3     6
12     E     1     7     8
13     E     5     6     0
14     E     4     4     0

In [4]:
df.groupby('index').mean()

           col1      col2      col3
index
A      4.000000  5.000000  2.500000
B      6.000000  1.666667  3.666667
C      4.000000  3.666667  3.666667
D      3.500000  3.000000  4.250000
E      3.333333  5.666667  2.666667

In [9]:
# df.groupby('index').count()
# df.groupby('index').max()
# df.groupby('index').min()
df.groupby('index').sum()
# df.groupby('index').std()
# df.groupby('index').var()

       col1  col2  col3
index
A         8    10     5
B        18     5    11
C        12    11    11
D        14    12    17
E        10    17     8

In [10]:
def top (df,n=2,col='col1'):
    return df.sort_values(by=col)[-n:] #상위 n개 열을 반환하는 함수 top 생성

In [11]:
print(df.groupby('index').apply(top))

         index  col1  col2  col3
index
A     0      A     4     2     5
      1      A     4     8     0
B     3      B     7     2     6
      4      B     8     0     3
C     6      C     3     8     3
      5      C     8     2     7
D     8      D     4     1     8
      9      D     8     8     2
E     14     E     4     4     0
      13     E     5     6     0

C:\Users\samso\AppData\Local\Temp\ipykernel_22240\871578652.py:1: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  print(df.groupby('index').apply(top))

In [12]:
df_cat = pd.Categorical(df['index'], categories=['A','B','C','D','E','F']) # df의 index열에 대해서 A,B,C,D,E,F 로 Categorical을 하여 df_cat 생성
print(df_cat)

['A', 'A', 'B', 'B', 'B', ..., 'D', 'D', 'E', 'E', 'E']
Length: 15
Categories (6, object): ['A', 'B', 'C', 'D', 'E', 'F']

In [13]:
print(df['col1'].groupby(df_cat).count())

A    2
B    3
C    3
D    4
E    3
F    0
Name: col1, dtype: int64

C:\Users\samso\AppData\Local\Temp\ipykernel_22240\1552631802.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  print(df['col1'].groupby(df_cat).count())

In [14]:
print(df['col1'].groupby(df_cat,observed=True).count())

A    2
B    3
C    3
D    4
E    3
Name: col1, dtype: int64

In [16]:
df.loc[6,'index'] = np.nan

In [17]:
df

   index  col1  col2  col3
0      A     4     2     5
1      A     4     8     0
2      B     3     3     2
3      B     7     2     6
4      B     8     0     3
5      C     8     2     7
6    NaN     3     8     3
7      C     1     1     1
8      D     4     1     8
9      D     8     8     2
10     D     1     0     1
11     D     1     3     6
12     E     1     7     8
13     E     5     6     0
14     E     4     4     0

In [18]:
print(df.groupby('index').sum())

       col1  col2  col3
index
A         8    10     5
B        18     5    11
C         9     3     8
D        14    12    17
E        10    17     8

In [19]:
print(df.groupby('index',dropna=False).sum())

       col1  col2  col3
index
A         8    10     5
B        18     5    11
C         9     3     8
D        14    12    17
E        10    17     8
NaN       3     8     3

In [20]:
idx = [['idx1','idx1','idx2','idx2','idx2'],['row1','row2','row1','row2','row3']]
col = ['col1','col2','col2']
data = np.random.randint(0,9,(5,3))
df = pd.DataFrame(data=data, index = idx, columns = col).rename_axis(index=['lv0','lv1'])
print(df)

           col1  col2  col2
lv0  lv1
idx1 row1     5     3     2
     row2     0     8     0
idx2 row1     2     0     4
     row2     6     2     8
     row3     4     5     8

In [21]:
print(df.groupby(level=1).sum())

      col1  col2  col2
lv1
row1     7     3     6
row2     6    10     8
row3     4     5     8

In [22]:
print(df.groupby(['lv1','lv0']).sum())

           col1  col2  col2
lv1  lv0
row1 idx1     5     3     2
     idx2     2     0     4
row2 idx1     0     8     0
     idx2     6     2     8
row3 idx2     4     5     8